zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing.c
#if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)|| (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
/*******************************************************************************
* Function Name: Cy_CapSense_ScanAllSlots
****************************************************************************//**
*
* Initiates the non-blocking scan of all Active slots and then exits. Scanning
* is initiated only if no scan is in progress. To initiate all Low Power slot
* scan use the Cy_CapSense_ScanAllLpSlots() function.
*
* \par
* * For fifth-generation low power CAPSENSE&trade;
* This function loads slots configurations into the internal buffer of the
* CAPSENSE&trade; hardware block and triggers scanning.
* If the scan frame doesn`t fit into the internal buffer it will be processed as
* the sequence of sub-frames. Next sub-frame will be loaded by the interrupt
* service routine(part of middleware) once scan of previous sub-frame is complete.
* The scanning process duration consists of a some
* pre-configured interval and a frame scan duration. The first slot scan starts
* after the pre-configured interval. The default duration of the interval is
* 1 ILO cycle. The interval duration can be changed
* by the Cy_CapSense_ConfigureMsclpTimer() function.
* If the "Enable external frame start" option is disabled in the CAPSENSE&trade;
* Configurator, the scanning process will be triggered immediately.
* If the "Enable external frame start" option is enabled in the CAPSENSE&trade;
* Configurator, the scanning process will be triggered by the first external
* synchronization signal after a function call.
* The number of slots in frame in this case should not exceed the maximum
* possible slot number to fit into the internal buffer of the CAPSENSE&trade;
* hardware block.
* The External synchronization signal parameters should meet the following
* constraints:
*   * - the interval between the return of the function and the rising edge
*     of an external synchronization signal must not be less than 2 ILO cycles;
*   * - the pulse duration of an external synchronization signal
*     (if the signal is in High level) must not be less than 2 ILO cycles and more
*     than the full scanning process duration. The full scanning process
*     duration is the time between the rising edge of the external
*     synchronization pulse and clearing of BUSY flag. The Cy_CapSense_IsBusy()
*     function can be used to check BUSY flag;
*   * - the interval between sub-sequent pulses should not be less than full
*     scanning process duration.
* Disregarding the "Enable external frame start" option, the transition into
* system DEEP SLEEP mode is allowed after the scan process is started
* by the function.
* To decrease the start scan time when it is intended to scan the same frame,
* i.e. startSlotId and numberSlots parameters are the same, then the scan
* is performed without the MSC HW block reconfiguration.
* In this case, the number of slots in the frame shall not exceed the maximum
* possible slot number to fit into the internal buffer of the CAPSENSE&trade;
* hardware block.
*
* \par
* * For fifth-generation CAPSENSE&trade; this function initiates a scan for
* the first slot for all channels and then exits. Scans for the remaining slots
* in the Interrupt-driven scan mode are initiated in the interrupt service
* routine (part of middleware) triggered at the end
* of each scan completed for each channel. If the syncMode field in the
* cy_stc_capsense_common_config_t structure is set to CY_CAPSENSE_SYNC_MODE_OFF,
* then the next slot scan for the channel with the fired interrupt,
* will start regardless of the another channel readiness for the next scan.
* If the syncMode field is set to CY_CAPSENSE_SYNC_INTERNAL (for single-chip projects)
* or to CY_CAPSENSE_SYNC_EXTERNAL (for multi-chip projects),
* then the next slot scan for the channel with the fired interrupt,
* will start in lockstep with another channels after they all are ready
* for the next scan (the next scan configuration is loaded into the channel MSC HW block).
* Scans for the remaining slots in CS-DMA scan mode are initiated
* by DMAC triggered at the end
* of each scan completed for each channel. The channel scan synchronization is
* performed as in Interrupt-driven scan mode. After all slots are scanned,
* the FRAME interrupt is fired and the interrupt service routine (part of middleware)
* updates the busy status. The transition into system DEEP SLEEP mode is allowed
* only when all scans are finished.
*
* If the middleware is busy, do not initiate a new scan or set up widgets.
* Use the Cy_CapSense_IsBusy() function to check HW busyness at a particular moment.
* Use the Cy_CapSense_MwState() function to verify if MW executes any firmware 
* tasks related to initialization, scanning, and processing at a particular moment.
*
* \note
* This function is available for the fifth-generation and fifth-generation low power CAPSENSE&trade;.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The HW is busy with the previous scan.
* - CY_CAPSENSE_STATUS_MIXED_SENSORS    - The requested sensors types can't be scanned
*                                         in one frame (in autonomous mode).
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanAllSlots(
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;

    if (NULL != context)
    {
        capStatus = Cy_CapSense_ScanSlots(0u, CY_CAPSENSE_SLOT_COUNT, context);
    }

    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ScanSlots
****************************************************************************//**
*
* Initiates the non-blocking scan of a specified regular slots set named "frame"
* and then exits.
* Scanning is initiated only if no scan is in progress.
* Check the status of the current scan using the Cy_CapSense_IsBusy()
* function. The application program should wait until the current frame scan is
* finished prior to start a next scan by using the function.
*
* \par
* * For fifth-generation low power CAPSENSE&trade;
* The function loads the frame configuration into the internal buffer of the
* CAPSENSE&trade; hardware block and triggers the scanning process.
* If the frame configuration does not fit into the internal buffer its scan will
* be processed as a sequence of sub-frame scans. A next sub-frame will be loaded
* by the interrupt service routine (part of the middleware)
* after the previous sub-frame scan is complete.
* The scanning process duration consists of a some
* pre-configured interval and a frame scan duration. The first slot scan starts
* after the pre-configured interval. The default duration of the interval is
* 1 ILO cycle. The interval duration can be changed
* by the Cy_CapSense_ConfigureMsclpTimer() function.
* If the "Enable external frame start" option is disabled in the CAPSENSE&trade;
* Configurator, the scanning process will be triggered immediately.
* If the "Enable external frame start" option is enabled in the CAPSENSE&trade;
* Configurator, the scanning process will be triggered by the first external
* synchronization signal after a function call.
* In this case, the number of slots in the frame shall not exceed the maximum
* possible slot number to fit into the internal buffer of the CAPSENSE&trade;
* hardware block.
* The External synchronization signal parameters should meet the following
* constraints:
*   * - the interval between the return of the function and the rising edge
*     of an external synchronization signal must not be less than 2 ILO cycles;
*   * - the pulse duration of an external synchronization signal
*     (if the signal is in High level) must not be less than 2 ILO cycles and more
*     than the full scanning process duration. The full scanning process
*     duration is the time between the rising edge of the external
*     synchronization pulse and clearing of BUSY flag. The Cy_CapSense_IsBusy()
*     function can be used to check BUSY flag;
*   * - the interval between sub-sequent pulses should not be less than full
*     scanning process duration.
* Disregarding the "Enable external frame start" option, the transition into
* a system DEEP SLEEP mode is allowed after the scan process is started
* by the function.
* To decrease the start scan time when it is intended to scan the same frame,
* i.e. startSlotId and numberSlots parameters are the same, then the scan
* is performed without the MSC HW block reconfiguration.
* In this case, the number of slots in the frame shall not exceed the maximum
* possible slot number to fit into the internal buffer of the CAPSENSE&trade;
* hardware block.
*
* \par
* * For fifth-generation CAPSENSE&trade; this function initiates a scan for
* the first slot for all channels and then exits. Scans for the remaining slots
* in the Interrupt-driven scan mode are initiated in the interrupt service
* routine (part of middleware) triggered at the end
* of each scan completed for each channel. If the syncMode field in the
* cy_stc_capsense_common_config_t structure is set to CY_CAPSENSE_SYNC_MODE_OFF,
* then the next slot scan for the channel with the fired interrupt,
* will start regardless of the another channel readiness for the next scan.
* If the syncMode field is set to CY_CAPSENSE_SYNC_INTERNAL (for single-chip
* projects) or to CY_CAPSENSE_SYNC_EXTERNAL (for multi-chip projects),
* then the next slot scan for the channel with the fired interrupt,
* will start in lockstep with another channels after they all are ready
* for the next scan.
* The scan for the remaining slots in CS-DMA scan mode are initiated
* by DMAC triggered at the end
* of each scan completion for each channel. The channel scan synchronization is
* performed as in Interrupt-driven scan mode. After all specified slots are
* scanned, the FRAME interrupt is fired and the interrupt service routine
* (part of middleware) updates the busy status. The transition into a system
* DEEP SLEEP mode is allowed only when all specified scans are finished.
* To decrease the start scan time when it is intended to scan the same slot,
* i.e. the startSlotId parameter is the same and numberSlots = 1u, then the scan
* is performed without the MSC HW block reconfiguration. Also, in the legacy
* AMUX mode sensors are not disconnected.
*
* If the middleware is busy, do not initiate a new scan or set up widgets.
* Use the Cy_CapSense_IsBusy() function to check HW busyness at a particular moment.
* Use the Cy_CapSense_MwState() function to verify if MW executes any firmware 
* tasks related to initialization, scanning, and processing at a particular moment.
*
* \note
* This function is available for the fifth-generation and fifth-generation
* low power CAPSENSE&trade;.
*
* \param startSlotId
* The slot ID the scan of the specified frame will be started from.
*
* \param numberSlots
* The number of slots in the specified frame will be scanned.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The HW is busy with the previous scan.
* - CY_CAPSENSE_STATUS_MIXED_SENSORS    - The requested sensors types can't be scanned
*                                         in one frame (in autonomous mode).
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanSlots(
                uint32_t startSlotId,
                uint32_t numberSlots,
                cy_stc_capsense_context_t * context)
{
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        return Cy_CapSense_ScanSlots_V3(startSlotId, numberSlots, context);
    #else /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)*/
        return Cy_CapSense_ScanSlots_V3Lp(startSlotId, numberSlots, context);
    #endif
}
#endif


