zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing.c
/*******************************************************************************
* Function Name: Cy_CapSense_IsBusy
****************************************************************************//**
*
* This function returns a status whether MW executes HW scanning at a particular moment.
*
* If the middleware is busy, do not initiate a new scan or set up widgets.
* Use the Cy_CapSense_IsBusy() function to check HW busyness at a particular moment.
* Use the Cy_CapSense_MwState() function to verify if MW executes any firmware 
* tasks related to initialization, scanning, and processing at a particular moment.
* If the middleware is busy, a new scan, setup widgets, any kind of reconfiguration, 
* or parameter change should not be initiated.
*
* \param context
* The pointer to the CAPSENSE&trade; context
* structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the middleware as a sum of the masks.
* - CY_CAPSENSE_NOT_BUSY                - No scan is in progress and
*                                         a next scan can be initiated.
* - CY_CAPSENSE_BUSY                    - The previously initiated scan is
*                                         in progress.
*
*******************************************************************************/
uint32_t Cy_CapSense_IsBusy(
                const cy_stc_capsense_context_t * context)
{
    return (context->ptrCommonContext->status & CY_CAPSENSE_BUSY);
}


/*******************************************************************************
* Function Name: Cy_CapSense_InterruptHandler
****************************************************************************//**
*
* Implements interrupt service routine for CAPSENSE&trade; middleware.
*
* The CAPSENSE&trade; middleware uses this interrupt to implement a
* non-blocking sensor scan method, in which only the first sensor scan is
* initiated by the application program. Subsequent sensor scans are
* initiated in the interrupt service routine as soon as the current scan
* or current sub-frame is completed.
*
* The CAPSENSE&trade; middleware does not initialize or modify the priority
* of interrupts. For the proper middleware operation, the application program
* must configure CAPSENSE&trade; block interrupt and assign the interrupt
* vector to the Cy_CapSense_InterruptHandler() function. Refer to function
* usage example for details.
*
* The calls of the Start Sample and End Of Scan callbacks
* (see the \ref group_capsense_callbacks section for details) are the part
* of the Cy_CapSense_InterruptHandler() routine and they lengthen its execution.
* These callbacks should not lengthen the ISR execution too much to prevent
* different interrupt overlaps.
*
* \param base
* The pointer to the base register address of the CAPSENSE&trade; HW block.
* This argument is kept for uniformity and backward compatibility
* and is not used. The function can be called with value NULL.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \funcusage
*
* An example of the ISR initialization:
*
* The CapSense_ISR_cfg variable should be declared by the application
* program according to the examples below:<br>
* For Core CM0+:
* \snippet capsense/snippet/main.c snippet_m0p_capsense_interrupt_source_declaration
* \note MSCLP HW contains two interrupt sources.
* The CAPSENSE&trade; Middleware supports only the msclp_interrupt_<b>lp</b>_IRQn
* vector and therefore it should be used.
*
* For Core CM4:
* \snippet capsense/snippet/main.c snippet_m4_capsense_interrupt_source_declaration
*
* The CAPSENSE&trade; interrupt handler should be defined by the application program
* according to the example below:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_IntHandler
*
* Then, the application program should configure and enable the CSD block interrupt
* between calls of the Cy_CapSense_Init() and Cy_CapSense_Enable() functions:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_Initialization
*
* The CapSense_HW is the pointer to the base register address of
* the CAPSENSE&trade; HW block. A macro for the pointer is in the cycfg_peripherals.h
* file defined as \<Personality_Name\>_HW. If no name is specified,
* the following default names are used:
* * csd_\<Block_Number\>_csd_\<Block_Number\>_HW - for forth-generation CAPSENSE&trade; HW.
* * msc_\<Block_Number\>_msc_\<Block_Number\>_HW - for fifth-generation CAPSENSE&trade; HW.
* * msclp_\<Block_Number\>_msclp_\<Block_Number\>_HW - for fifth-generation low power CAPSENSE&trade; HW.
*
* An example of sharing the CSD HW block (fourth-generation CAPSENSE&trade;) by the CAPSENSE&trade;
* middleware and CSDADC middleware.<br>
* Declares the CapSense_ISR_cfg variable:
* \snippet capsense/snippet/main.c snippet_m4_capsense_interrupt_source_declaration
*
* Declares the CSDADC_ISR_cfg variable:
* \snippet capsense/snippet/main.c snippet_m4_adc_interrupt_source_declaration
*
* Defines the CAPSENSE&trade; interrupt handler:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_IntHandler
*
* Defines the CSDADC interrupt handler:
* \snippet capsense/snippet/main.c snippet_CSDADC_Interrupt
*
* The part of the main.c FW flow:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_TimeMultiplex
*
*******************************************************************************/
void Cy_CapSense_InterruptHandler(
                void * base,
                cy_stc_capsense_context_t * context)
{
    (void)base;
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        Cy_CapSense_InterruptHandler_V3(NULL, context);
    #elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        Cy_CapSense_InterruptHandler_V3Lp(NULL, context);
    #else /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */
        Cy_CapSense_InterruptHandler_V2(NULL, context);
    #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */
}


/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateAllWidgets
****************************************************************************//**
*
* Executes CapDAC/IDAC auto-calibration for all the sensors in all widgets
* of some sensing groups (CSD, CSX, or ISX) if calibration is enabled
* for such group of widgets. The auto-calibration finds CapDAC/IDAC values
* to have raw counts close to configured target values. Use sensing and
* processing functions after auto-calibration to update all baselines and
* configured filters.
*
* Having enabled the CDAC auto-calibration algorithm is the most common use
* case. It helps to tune your system considering board-to-board variation,
* temperature drift, etc. CDAC auto-calibration is enabled by default.
*
* The default auto-calibration target values are defined as:
* * 85% of the maximum raw count for CSD widgets
* * 40% of the maximum raw count for CSX widgets.
* * 40% of the maximum raw count for ISX widgets.
*
* Use the Cy_CapSense_SetCalibrationTarget() function to change calibration targets .
*
* For fifth-generation low power CAPSENSE&trade; the function calibrates only
* Active widgets. For Low Power widgets use
* the Cy_CapSense_CalibrateAllLpWidgets() function.
*
* This function detects the sensing method used by each widget and performs
* a successive approximation search algorithm to find the appropriate Reference
* and Compensation CapDAC (if enabled) values for all sensors for
* the fifth-generation CAPSENSE&trade; and for all Active sensors for
* the fifth-generation low power CAPSENSE&trade;. For the fifth-generation
* low power CAPSENSE&trade; if during the calibration process it is reached
* the Reference CapDAC value lower than /ref CY_CAPSENSE_CAL_REF_CDAC_MIN_CODE
* and Fine CapDAC usage is enabled in CAPSENSE&trade; Configurator then
* the FineCDAC calibration is performed with the reference CDAC value set to 0.
*
* For the the forth-generation
* CAPSENSE&trade; the function finds appropriate modulator and compensation
* IDAC (if enabled) values for all sensors in CSD widgets
* and/or IDAC values for all sensors in CSX widgets to make sensor raw count
* to the default value level.
*
* This function could be used only if Enable auto-calibration parameter
* is enabled for CSD and/or CSX (and/or ISX for fifth-generation low power
* CAPSENSE&trade;) widgets.
*
* For widgets configured with External Cref, the Reference CDAC calibration phase is
* skipped because the internal CDAC reference is not used. Only the Compensation CDAC
* Divider and Compensation CDAC calibration are performed.
*
* \note
* For the fifth-generation CAPSENSE&trade; this function is available in
* single-channel solution. It is recommended to use
* the Cy_CapSense_CalibrateAllSlots() function instead for compatibility with
* further CAPSENSE&trade; middleware versions.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation \ref cy_capsense_status_t.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateAllWidgets(
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t retVal = CY_CAPSENSE_STATUS_BAD_CONFIG;

