zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing.c
    (void)context;
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) || \
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN))
                retVal = Cy_CapSense_CalibrateAllWidgets_V3(context);
        #endif
    #elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) || \
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN))
                retVal = Cy_CapSense_CalibrateAllWidgets_V3Lp(context);
        #endif
    #else /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */
        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
                retVal = Cy_CapSense_CalibrateAllWidgets_V2(context);
        #endif
    #endif

    return retVal;
}


#if (((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) && \
     ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
      (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) || \
      (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN) || \
      (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN)))
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateAllSlots
****************************************************************************//**
*
* Executes CapDAC/IDAC auto-calibration for all the sensors in all widgets
* of some sensing groups (CSD, CSX, or ISX) if calibration is enabled
* for such group of widgets. The auto-calibration finds CapDAC/IDAC values
* to have raw counts close to configured target values. Use sensing and
* processing functions after auto-calibration to update all baselines and
* configured filters.
*
* Having enabled the CDAC auto-calibration algorithm is the most common use
* case. It helps to tune your system considering board-to-board variation,
* temperature drift, etc. CDAC auto-calibration is enabled by default.
*
* For fifth-generation low power CAPSENSE&trade; the function calibrates only
* Active widgets. For Low Power widgets use
* the Cy_CapSense_CalibrateAllLpWidgets() function.
*
* The function performs searching of Reference CDAC code, Compensation CDAC
* code Compensation Divider (whichever is enabled) by using a successive
* approximation method to make the sensor's raw count closest to the
* defined targets. The auto-calibration target values are defined
* (by default) as:
* * 85% of the maximum raw count for CSD widgets
* * 40% of the maximum raw count for CSX widgets.
* * 40% of the maximum raw count for ISX widgets.
*
* Use the Cy_CapSense_SetCalibrationTarget() function to change calibration targets .
*
* For the fifth-generation
* low power CAPSENSE&trade; if during the calibration process it is reached
* the Reference CapDAC value lower than /ref CY_CAPSENSE_CAL_REF_CDAC_MIN_CODE
* and Fine CapDAC usage is enabled in CAPSENSE&trade; Configurator then
* the FineCDAC calibration is performed with the reference CDAC value set to 0.
*
* For widgets configured with External Cref, the Reference CDAC calibration phase is
* skipped because the internal CDAC reference is not used. Only the Compensation CDAC
* Divider and Compensation CDAC calibration are performed.
*
* \note
* This function is available for the fifth-generation CAPSENSE&trade; and
* fifth-generation low power CAPSENSE&trade;.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration is failed due to
*                                         the issues with scanning (either
*                                         watchdog timer, interrupt breaking, etc.).
* - CY_CAPSENSE_STATUS_CALIBRATION_REF_CHECK_FAIL - The reference/fine CapDAC
*                                  calibration stage is failed as the raw count
*                                  minimum across widget is out of range.
* - CY_CAPSENSE_STATUS_CALIBRATION_CHECK_FAIL - The resulting rawcounts across
*                                  all sensors in widget are out of defined range.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateAllSlots(cy_stc_capsense_context_t * context)
{
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
            return Cy_CapSense_CalibrateAllSlots_V3(context);
        #else
            (void)context;
            return CY_CAPSENSE_STATUS_BAD_PARAM;
        #endif    
    #else
        return Cy_CapSense_CalibrateAllSlots_V3Lp(context);
    #endif
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetCalibrationTarget
****************************************************************************//**
*
* Sets the CapDAC auto-calibration raw count target for CSD, CSX or ISX
* widgets. The function only updates the target value, use
* Cy_CapSense_CalibrateWidget() / Cy_CapSense_CalibrateAllWidgets() /
* Cy_CapSense_CalibrateAllLpWidgets() / Cy_CapSense_CalibrateAllSlots() to change
* raw counts according to the updated target.
*
* The function sets the specified raw count targets if CSD, CSX and/or ISX
* widgets are in the project and the auto-calibration is enabled for them. These
* targets will be used instead the configured ones by
* Cy_CapSense_CalibrateAllSlots(), Cy_CapSense_CalibrateAllWidgets() and
* Cy_CapSense_CalibrateWidget() functions.
*
* \note
* This function is available only for the fifth-generation CAPSENSE&trade; and
* fifth-generation low power CAPSENSE&trade;.
*
* \param calibrTarget
* The raw counts target in percentage for the specified sensing method.
* It should be in range [1..99]. If the specified target is
* outside the range, then it will not be updated and the
* CY_CAPSENSE_STATUS_BAD_PARAM status will be returned.
*
* \param snsMethod
* Desired sensing method the calibration target should be updated for:
* * CY_CAPSENSE_CSD_GROUP - CSD sensing method
* * CY_CAPSENSE_CSX_GROUP - CSX sensing method
* * CY_CAPSENSE_ISX_GROUP - ISX sensing method
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - At least one of the input parameter is
*                                         invalid.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SetCalibrationTarget(
                uint32_t calibrTarget,
                uint32_t snsMethod,
                cy_stc_capsense_context_t * context)
{
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
            return Cy_CapSense_SetCalibrationTarget_V3(calibrTarget, snsMethod, context);
        #else
            (void)calibrTarget;
            (void)snsMethod;
            (void)context;
            return CY_CAPSENSE_STATUS_BAD_PARAM;
        #endif
    #else
        return Cy_CapSense_SetCalibrationTarget_V3Lp(calibrTarget, snsMethod, context);
    #endif
}
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN || CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */


