zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing.c
    if ((NULL != context) && (NULL != ptrEltdCfg) && (CY_CAPSENSE_SLOT_COUNT > slotId))
    {
        result = Cy_CapSense_ConvertPinState(pinState, &localPinState);

        if ((uint32_t)CY_CAPSENSE_SUCCESS_E == result)
        {
            #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
                result = Cy_CapSense_SlotPinState_V3(slotId, ptrEltdCfg, localPinState, context);
            #else /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */
                result =  Cy_CapSense_SlotPinState_V3Lp(slotId, ptrEltdCfg, localPinState, context);
            #endif
        }
    }

    return result;
}
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP || \
           ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) && \
            (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD))) */


/*******************************************************************************
* Function Name: Cy_CapSense_SetInactiveElectrodeState
****************************************************************************//**
*
* Sets a desired state for all inactive CAPSENSE&trade;-related electrodes
* for CSD, CSX, ISX scans, or BIST measurement scans.
*
* Use the function to set/change the desired state
* of all CAPSENSE&trade;-related
* electrodes which are not scanned during regular scans or BIST capacitance
* measurements. There are separate states for the CSD
* sensing method group, the CSX sensing method group, the ISX sensing method
* group, the BIST CSD sensor
* (electrode) capacitance measurement, the BIST CSX sensor
* (electrode) capacitance measurement, and the BIST shield electrode
* capacitance measurement. For instance, it can be configured the GND state
* for all inactive sensors for CSX scanning and the High-Z state for CSD
* scanning and the Shield state for BIST CSD sensor (electrode) capacitance
* measurement.
* The function updates some corresponding parameters in the CAPSENSE&trade; Data
* Structure to provide the desired state and not changes pin state immediately.
* The desired state will be applied to all inactive electrodes
* during the CSD, CSX, ISX scans or BIST capacitance measurements.
* It is not recommended to update the Data Structure registers directly.
* Additionally (only for fifth-generation CAPSENSE&trade;), the function
* recalculates sensor frames in a case of the CTRLMUX sensor connection method.
* For fifth-generation low power CAPSENSE&trade;, the function always
* recalculates all sensor frames including low-power sensors.
*
* \note ISX sensing method is only available for fifth-generation low power CAPSENSE&trade;.
*
* \param  inactiveState
* Specifies the inactive CAPSENSE&trade; electrode state:
* - CY_CAPSENSE_SNS_CONNECTION_HIGHZ
* - CY_CAPSENSE_SNS_CONNECTION_SHIELD (only for CSD scan)
* - CY_CAPSENSE_SNS_CONNECTION_GROUND
* - CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2 (only for CSX scan)
*
* \param sensingGroup
* Specifies the sensing group:
* - CY_CAPSENSE_CSD_GROUP
* - CY_CAPSENSE_CSX_GROUP
* - CY_CAPSENSE_ISX_GROUP
* - CY_CAPSENSE_WBX_GROUP
* - CY_CAPSENSE_BIST_CSD_GROUP
* - CY_CAPSENSE_BIST_CSX_GROUP
* - CY_CAPSENSE_BIST_SHIELD_GROUP
*
* \param context
* The pointer to the CAPSENSE&trade; context
* structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation \ref cy_capsense_status_t.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SetInactiveElectrodeState(
             uint32_t inactiveState,
             uint32_t sensingGroup,
             cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        uint32_t curChIndex;
    #endif

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN)
        cy_en_capsense_bist_io_state_t inactiveStateBist;
    #endif

    if (NULL != context)
    {
        context->ptrActiveScanSns->currentSenseMethod = CY_CAPSENSE_UNDEFINED_GROUP;
        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN || CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
            (void)Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_UNDEFINED, context);
        #endif

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN)
            switch (inactiveState)
            {
                case CY_CAPSENSE_SNS_CONNECTION_GROUND:
                    inactiveStateBist = CY_CAPSENSE_BIST_IO_STRONG_E;
                    break;
                case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
                    inactiveStateBist = CY_CAPSENSE_BIST_IO_HIGHZA_E;
                    break;
                case CY_CAPSENSE_SNS_CONNECTION_SHIELD:
                    inactiveStateBist = CY_CAPSENSE_BIST_IO_SHIELD_E;
                    break;
                case CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2:
                    inactiveStateBist = CY_CAPSENSE_BIST_IO_VDDA2_E;
                    break;
                default:
                    inactiveStateBist = CY_CAPSENSE_BIST_IO_UNDEFINED_E;
                    break;
            }

            if ((CY_CAPSENSE_BIST_CSD_GROUP == sensingGroup) &&
                ((CY_CAPSENSE_SNS_CONNECTION_GROUND == inactiveState) ||
                 (CY_CAPSENSE_SNS_CONNECTION_HIGHZ == inactiveState) ||
                 (CY_CAPSENSE_SNS_CONNECTION_SHIELD == inactiveState)))
            {
                capStatus = CY_CAPSENSE_STATUS_SUCCESS;
                if (context->ptrBistContext->intrEltdCapCsdISC != inactiveStateBist)
                {
                    context->ptrBistContext->intrEltdCapCsdISC = inactiveStateBist;
                }
            }

            if ((CY_CAPSENSE_BIST_CSX_GROUP == sensingGroup) &&
                ((CY_CAPSENSE_SNS_CONNECTION_GROUND == inactiveState) ||
                 #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_DISABLE)
                 (CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2 == inactiveState) ||
                 #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_DISABLE) */
                 (CY_CAPSENSE_SNS_CONNECTION_HIGHZ == inactiveState)))
            {
                capStatus = CY_CAPSENSE_STATUS_SUCCESS;
                if (context->ptrBistContext->intrEltdCapCsxISC != inactiveStateBist)
                {
                    context->ptrBistContext->intrEltdCapCsxISC = inactiveStateBist;
                }
            }

            if ((CY_CAPSENSE_BIST_SHIELD_GROUP == sensingGroup) &&
                ((CY_CAPSENSE_SNS_CONNECTION_GROUND == inactiveState) ||
                 (CY_CAPSENSE_SNS_CONNECTION_HIGHZ == inactiveState) ||
                 (CY_CAPSENSE_SNS_CONNECTION_SHIELD == inactiveState)))
            {
                capStatus = CY_CAPSENSE_STATUS_SUCCESS;
                if (context->ptrBistContext->intrEltdCapShieldISC != inactiveStateBist)
                {
                    context->ptrBistContext->intrEltdCapShieldISC = inactiveStateBist;
                }
            }
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) */

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
            if ((CY_CAPSENSE_CSD_GROUP == sensingGroup) &&
                ((CY_CAPSENSE_SNS_CONNECTION_GROUND == inactiveState) ||
                 (CY_CAPSENSE_SNS_CONNECTION_HIGHZ == inactiveState) ||
                 (CY_CAPSENSE_SNS_CONNECTION_SHIELD == inactiveState)))
            {
                capStatus = CY_CAPSENSE_STATUS_SUCCESS;
                if (context->ptrInternalContext->intrCsdInactSnsConn != (uint8_t)inactiveState)
                {
                    context->ptrInternalContext->intrCsdInactSnsConn = (uint8_t)inactiveState;
                    #if (!CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                        Cy_CapSense_SetCsdInactiveState(context);
                    #else
                        capStatus = Cy_CapSense_GeneratePinFunctionConfig(context);
                    #endif
                }
            }
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
            #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN || CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                if ((CY_CAPSENSE_CSX_GROUP == sensingGroup) &&
                    ((CY_CAPSENSE_SNS_CONNECTION_GROUND == inactiveState) ||
                     (CY_CAPSENSE_SNS_CONNECTION_HIGHZ == inactiveState) ||
                     ((CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2 == inactiveState))))
                {
                    capStatus = CY_CAPSENSE_STATUS_SUCCESS;
                    if (context->ptrInternalContext->intrCsxInactSnsConn != (uint8_t)inactiveState)
                    {
                        /* There are MSC HW modules that should be enabled and the MSC HW internal switches
                         * that should be closed only if VDDA/2 Inactive Sensor Connection is used. These
                         * modules and switches are part of the Base configuration of the MSC HW block.
                         * The code below is intended to generate the Base MSC HW configuration depending
                         * on the Inactive Sensor Connection selection.
                        */
                        if ((CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2 == context->ptrInternalContext->intrCsxInactSnsConn) ||
                           (CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2 == inactiveState))
                        {
                            context->ptrInternalContext->intrCsxInactSnsConn = (uint8_t)inactiveState;

                            #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
                                for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                                {
                                    /* Generate base frame configurations for all enabled MSC channels, depending on
                                     * the Inactive Sensor Connection selection.
                                     */
                                    capStatus = Cy_CapSense_GenerateBaseConfig(curChIndex, context);

                                    if (CY_CAPSENSE_STATUS_SUCCESS != capStatus)
                                    {
                                        break;
                                    }
                                }
                                Cy_CapSense_SetCsxInactiveState(context);
                            #else /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP */
                                capStatus |= Cy_CapSense_GenerateBaseConfig(context);
                            #endif
                        }
                        else
                        {
                            context->ptrInternalContext->intrCsxInactSnsConn = (uint8_t)inactiveState;
                            #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                                capStatus = Cy_CapSense_GeneratePinFunctionConfig(context);
                            #else
                                Cy_CapSense_SetCsxInactiveState(context);
                            #endif
                        }
                    }
                }
            #else /* CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN */
                if ((CY_CAPSENSE_CSX_GROUP == sensingGroup) &&
                    ((CY_CAPSENSE_SNS_CONNECTION_GROUND == inactiveState) ||
                     (CY_CAPSENSE_SNS_CONNECTION_HIGHZ == inactiveState)))
                 {
                    capStatus = CY_CAPSENSE_STATUS_SUCCESS;
                    if (context->ptrInternalContext->intrCsxInactSnsConn != (uint8_t)inactiveState)
                    {
                        context->ptrInternalContext->intrCsxInactSnsConn = (uint8_t)inactiveState;
                        Cy_CapSense_SetCsxInactiveState(context);
                    }
                 }
            #endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN || CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

        #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN))
            if ((CY_CAPSENSE_ISX_GROUP == sensingGroup) &&
                ((CY_CAPSENSE_SNS_CONNECTION_GROUND == inactiveState) ||
                (CY_CAPSENSE_SNS_CONNECTION_HIGHZ == inactiveState)))
            {
                capStatus = CY_CAPSENSE_STATUS_SUCCESS;
                if (context->ptrInternalContext->intrIsxInactSnsConn != (uint8_t)inactiveState)
                {
                    context->ptrInternalContext->intrIsxInactSnsConn = (uint8_t)inactiveState;
                    capStatus = Cy_CapSense_GeneratePinFunctionConfig(context);
                }
            }
        #endif

