zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing.c
        #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN))
            if ((CY_CAPSENSE_WBX_GROUP == sensingGroup) &&
                ((CY_CAPSENSE_SNS_CONNECTION_GROUND == inactiveState) ||
                (CY_CAPSENSE_SNS_CONNECTION_HIGHZ == inactiveState)))
            {
                capStatus = CY_CAPSENSE_STATUS_SUCCESS;
                if (context->ptrInternalContext->intrWbxInactSnsConn != (uint8_t)inactiveState)
                {
                    context->ptrInternalContext->intrWbxInactSnsConn = (uint8_t)inactiveState;
                    capStatus = Cy_CapSense_GeneratePinFunctionConfig(context);
                }
            }
        #endif

        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
            for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
            {
                context->ptrActiveScanSns[curChIndex].currentSenseMethod = CY_CAPSENSE_UNDEFINED_GROUP;

                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
                    if ((CY_CAPSENSE_STATUS_SUCCESS == capStatus) &&
                        ((CY_CAPSENSE_CSD_GROUP == sensingGroup) ||
                         (CY_CAPSENSE_CSX_GROUP == sensingGroup)))
                    {
                        Cy_CapSense_GenerateAllSensorConfig(curChIndex, &context->ptrSensorFrameContext[(CY_CAPSENSE_SLOT_COUNT *
                                    (curChIndex + context->ptrCommonConfig->channelOffset)) * CY_MSC_6_SNS_REGS], context);
                    }
                #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */

            }
        #elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
            context->ptrActiveScanSns->currentSenseMethod = CY_CAPSENSE_UNDEFINED_GROUP;

            if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
            {
                switch (sensingGroup)
                {
                    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_EN)
                        case CY_CAPSENSE_CSD_GROUP:
                    #endif
                    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSX_EN)
                        case CY_CAPSENSE_CSX_GROUP:
                    #endif
                    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_ISX_EN)
                        case CY_CAPSENSE_ISX_GROUP:
                    #endif
                    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_WBX_EN)
                        case CY_CAPSENSE_WBX_GROUP:
                    #endif
                        Cy_CapSense_GenerateAllSensorConfig(CY_CAPSENSE_SNS_FRAME_ACTIVE, context);

                        #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_LP_EN)
                            Cy_CapSense_GenerateAllSensorConfig(CY_CAPSENSE_SNS_FRAME_LOW_POWER, context);
                        #endif /* CY_CAPSENSE_LP_EN */

                        break;
                    default:
                        /* Do nothing */
                        break;
                }
            }
        #endif
    }
    return capStatus;
}

#if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)|| (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
/*******************************************************************************
* Function Name: Cy_CapSense_ScanAbort
****************************************************************************//**
*
* This function sets the sequencer to the idle state by resetting the hardware,
* it can be used to abort current scan.
*
* \note
* This function is available for the fifth-generation CAPSENSE&trade; and
* fifth-generation low power CAPSENSE&trade;.
*
* \note
* If this function is called from ISR during initialization or
* auto-calibration the operation of these functions will be corrupted.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation \ref cy_capsense_status_t.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanAbort(cy_stc_capsense_context_t * context)
{
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        return Cy_CapSense_ScanAbort_V3(context);
    #elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        return Cy_CapSense_ScanAbort_V3Lp(context);
    #endif
}
#endif


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) && (!CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
/*******************************************************************************
* Function Name: Cy_CapSense_SetCsdInactiveState
****************************************************************************//**
*
* Sets a desired pin state for all inactive CAPSENSE&trade;-related electrodes
* for CSD scans.
*
* There is the internal function and it is not recommended to call it directly
* from the application program. The function sets the desired state of all
* CSD group CAPSENSE&trade;-related electrodes which are not scanned.
* The function updates some corresponding parameters in the CAPSENSE&trade; Data
* Structure to provide the desired state and not changes pin state immediately.
* The desired state will be applied to all inactive electrodes during the CSD scan.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetCsdInactiveState(
             cy_stc_capsense_context_t * context)
{
    context->ptrInternalContext->csdInactiveSnsHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
    switch (context->ptrInternalContext->intrCsdInactSnsConn)
    {
        case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
            context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_GPIO_ANALOG;
            break;

        case CY_CAPSENSE_SNS_CONNECTION_SHIELD:
            context->ptrInternalContext->csdInactiveSnsHsiom = CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD;
            #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
                if (CY_CAPSENSE_SHIELD_ACTIVE == context->ptrCommonConfig->csdShieldMode)
                {
                    context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_GPIO_ANALOG;
                }
                else
                {
                    context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
                }
            #endif

            #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
                context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_SHIELD;
            #endif
            break;

        case CY_CAPSENSE_SNS_CONNECTION_GROUND:
            /* CY_CAPSENSE_SNS_CONNECTION_GROUND */
            context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
            break;

        default:
            /* Set the default pin state: High-Z */
            context->ptrInternalContext->csdInactiveSnsDm = CY_CAPSENSE_DM_GPIO_ANALOG;
            break;
    }
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) && (!CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) && (!CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
/*******************************************************************************
* Function Name: Cy_CapSense_SetCsxInactiveState
****************************************************************************//**
*
* Sets a desired pin state for all inactive CAPSENSE&trade;-related electrodes
* for CSX scans.
*
* There is the internal function and it is not recommended to call it directly
* from the application program. The function sets the desired state of all
* CSX group CAPSENSE&trade;-related electrodes which are not scanned.
* The function updates some corresponding parameters in the CAPSENSE&trade; Data
* Structure to provide the desired state and not changes pin state immediately.
* The desired state will be applied to all inactive electrodes during the CSX scan.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetCsxInactiveState(
             cy_stc_capsense_context_t * context)
{
    context->ptrInternalContext->csxInactiveSnsHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
    switch (context->ptrInternalContext->intrCsxInactSnsConn)
    {
        case CY_CAPSENSE_SNS_CONNECTION_HIGHZ:
            context->ptrInternalContext->csxInactiveSnsDm = CY_CAPSENSE_DM_GPIO_ANALOG;
            break;
        case CY_CAPSENSE_SNS_CONNECTION_GROUND:
            /* CY_CAPSENSE_SNS_CONNECTION_GROUND */
            context->ptrInternalContext->csxInactiveSnsDm = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
            break;
        case CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2:
            /* CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2 */
            context->ptrInternalContext->csxInactiveSnsHsiom = CY_CAPSENSE_HSIOM_SEL_AMUXB;
            context->ptrInternalContext->csxInactiveSnsDm = CY_CAPSENSE_DM_GPIO_ANALOG;
            break;
        default:
            /* Set the default pin state: High-Z */
            context->ptrInternalContext->csxInactiveSnsDm = CY_CAPSENSE_DM_GPIO_ANALOG;
            break;
    }
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) && (!CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */


#if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN))
/*******************************************************************************
* Function Name: Cy_CapSense_InitializeMaxRaw
****************************************************************************//**
*
* Initializes the maxRawCount and the maxRawCountRow fields of the
* cy_stc_capsense_widget_context_t structure for the specified widget.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS      - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_TIMEOUT      - A timeout reached during the scan time measurement.
* - CY_CAPSENSE_STATUS_BAD_PARAM    - Not valid input parameter.
* - CY_CAPSENSE_STATUS_HW_BUSY      - The MSCLP HW block is busy and cannot be
*                                     switched to another mode.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_InitializeMaxRaw(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    uint32_t tmpVal;
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        uint32_t scanSlotId;
        const cy_stc_capsense_scan_slot_t * ptrScanSlots;
    #endif
    uint32_t tempRaw = 0u;

