zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing.c
    if (0u != (CY_CAPSENSE_WD_MAXCOUNT_CALC_MASK & ptrWdCfg->ptrWdContext->status))
    {
        /* Prepare and execute the measurement to obtain the MAX raw count for the one-dimension widgets
         * or columns for two-dimension widgets.
         */
        tmpVal = ptrWdCfg->firstSlotId;
        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
            capStatus |= Cy_CapSense_ExecuteSaturatedScan(&tempRaw, widgetId,
                    tmpVal, CY_CAPSENSE_SATURATED_MAX_COUNT, context);
        #else
            capStatus |= Cy_CapSense_ExecuteSaturatedScan(&tempRaw,
                    tmpVal, CY_CAPSENSE_SATURATED_MAX_COUNT, context);
        #endif
        if (CY_CAPSENSE_16_BIT_MASK < tempRaw)
        {
            tempRaw = CY_CAPSENSE_16_BIT_MASK;
        }
        ptrWdCfg->ptrWdContext->maxRawCount = (uint16_t)tempRaw;
    }

    #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
        {
           if (((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdCfg->wdType) || ((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdCfg->wdType))
            {
                if (0u != (CY_CAPSENSE_WD_MAXCOUNT_ROW_CALC_MASK & ptrWdCfg->ptrWdContext->status))
                {
                    /* Prepare and execute the measurement to obtain the MAX raw count for rows for two-dimension widgets. */
                    scanSlotId = (uint32_t)ptrWdCfg->firstSlotId + ptrWdCfg->numSlots - 1u;

                    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                        capStatus |= Cy_CapSense_ExecuteSaturatedScan(&tempRaw, widgetId,
                                scanSlotId, CY_CAPSENSE_SATURATED_MAX_COUNT, context);
                        ptrWdCfg->ptrWdContext->maxRawCountRow = (uint16_t)tempRaw;
                    #else
                        capStatus |= Cy_CapSense_ExecuteSaturatedScan(&tempRaw,
                                scanSlotId, CY_CAPSENSE_SATURATED_MAX_COUNT, context);
                    #endif

                    if (CY_CAPSENSE_16_BIT_MASK < tempRaw)
                    {
                        tempRaw = CY_CAPSENSE_16_BIT_MASK;
                    }
                    ptrWdCfg->ptrWdContext->maxRawCountRow = (uint16_t)tempRaw;
                    /* For the multi-channel mode, iterate through enabled channels and find the sensing channel that
                     * drives the sensor (not Shield only, Tx only, or Empty).
                     */
                    for (tmpVal = 0u; tmpVal < CY_CAPSENSE_TOTAL_CH_NUMBER; tmpVal++)
                    {
                        ptrScanSlots = &context->ptrScanSlots[scanSlotId + (CY_CAPSENSE_SLOT_COUNT * tmpVal)];
                        if (CY_CAPSENSE_SLOT_SHIELD_ONLY > ptrScanSlots->wdId)
                        {
                            break;
                        }
                    }
                    if (tmpVal >= CY_CAPSENSE_TOTAL_CH_NUMBER)
                    {
                        capStatus |= CY_CAPSENSE_STATUS_BAD_CONFIG;
                    }

                    /* Swap the row and column MAX raw count values in case if rows are scanned before
                     * columns (the row's sensor is placed to the first slot of the widget).
                     */
                    if (ptrWdCfg->numRows >= ptrScanSlots->snsId)
                    {
                        tmpVal = ptrWdCfg->ptrWdContext->maxRawCount;
                        ptrWdCfg->ptrWdContext->maxRawCount = ptrWdCfg->ptrWdContext->maxRawCountRow;
                        ptrWdCfg->ptrWdContext->maxRawCountRow = (uint16_t)tmpVal;
                    }
                }
            }
        }
    #endif

    return capStatus;
}
#endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)) */


#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP || \
     ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) && \
      (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)))
/*******************************************************************************
* Function Name: Cy_CapSense_ConvertPinState
****************************************************************************//**
*
* The internal function that converts specified electrode state to the
* internal format, depending on the used CAPSENSE&trade; platform.
*
* \note
* This function is available for the fifth-generation (only
* for CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) and fifth-generation low power
* CAPSENSE&trade;.
*
* \param pinState
* The desired pins state for CSX widget electrodes could be:
* * CY_CAPSENSE_RX_PIN - Rx electrode
* * CY_CAPSENSE_TX_PIN - Tx electrode
* * CY_CAPSENSE_GROUND - Grounded
* * CY_CAPSENSE_NEGATIVE_TX_PIN - Negative Tx electrode
*     (for multi-phase TX method)
* * CY_CAPSENSE_HIGHZ - Unconnected (High-Z)
* * CY_CAPSENSE_VDDA2 - Connected to VDDA/2.
* The desired pins state for CSD widget electrodes could be:
* * CY_CAPSENSE_SENSOR - Self-cap sensor
* * CY_CAPSENSE_HIGHZ - Unconnected (High-Z)
* * CY_CAPSENSE_GROUND - Grounded
* * CY_CAPSENSE_SHIELD - Shield is routed to the pin.
* The desired pins state for ISX widget electrodes could be:
* * CY_CAPSENSE_ISX_RX_PIN - ISX Rx electrode
* * CY_CAPSENSE_ISX_LX_PIN - ISX Lx electrode
* * CY_CAPSENSE_HIGHZ - Unconnected (High-Z)
* * CY_CAPSENSE_VDDA2 - Connected to VDDA/2.
* The desired pins state for WBX widget electrodes could be:
* * CY_CAPSENSE_PIN_STATE_WBX_NODE_A - Node A electrode.
* * CY_CAPSENSE_PIN_STATE_WBX_NODE_B - Node B electrode.
* * CY_CAPSENSE_HIGHZ - Unconnected (high-z).
* * CY_CAPSENSE_GROUND - Grounded.
*
* \param convertedPinState
* The pointer to the converted pins state value.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS   - Indicates the successful electrode setting conversion.
* - CY_CAPSENSE_STATUS_BAD_PARAM - 1) pinState is not valid;
*                      2) the CSD sensing method is disabled for desired
*                         CY_CAPSENSE_SHIELD or CY_CAPSENSE_SENSOR states;
*                      3) the CSX sensing method is disabled for desired
*                         CY_CAPSENSE_TX_PIN, CY_CAPSENSE_NEGATIVE_TX_PIN or
*                         CY_CAPSENSE_RX_PIN states;
*                      4) the ISX sensing method is disabled for desired
*                         CY_CAPSENSE_ISX_RX_PIN or CY_CAPSENSE_ISX_LX_PIN
*                         states (Only for fifth-generation low power CAPSENSE&trade;).
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ConvertPinState(
                uint32_t pinState,
                uint32_t * convertedPinState)
{
    cy_capsense_status_t result = CY_CAPSENSE_STATUS_BAD_PARAM;

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        switch (pinState)
        {
            case CY_CAPSENSE_GROUND:
                    *convertedPinState = CY_CAPSENSE_PIN_STATE_IDX_GND;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;

