zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing.c
            case CY_CAPSENSE_HIGHZ:
                    *convertedPinState = CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
            case CY_CAPSENSE_SENSOR:
                    *convertedPinState = CY_CAPSENSE_PIN_STATE_IDX_CSD_SNS;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
            case CY_CAPSENSE_SHIELD:
                    #if (CY_CAPSENSE_CSD_SHIELD_MODE == CY_CAPSENSE_SHIELD_ACTIVE)
                        *convertedPinState = CY_CAPSENSE_PIN_STATE_IDX_ACT_SHIELD;
                    #else
                        *convertedPinState = CY_CAPSENSE_PIN_STATE_IDX_PAS_SHIELD;
                    #endif
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;
            #endif
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */


        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
            case CY_CAPSENSE_TX_PIN:
                    *convertedPinState = CY_CAPSENSE_PIN_STATE_IDX_CSX_TX;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;

            case CY_CAPSENSE_RX_PIN:
                    *convertedPinState = CY_CAPSENSE_PIN_STATE_IDX_CSX_RX;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;

            case CY_CAPSENSE_NEGATIVE_TX_PIN:
                    *convertedPinState = CY_CAPSENSE_PIN_STATE_IDX_CSX_NEG_TX;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;

            case CY_CAPSENSE_VDDA2:
                    *convertedPinState = CY_CAPSENSE_PIN_STATE_IDX_CSX_VDDA2;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
            case CY_CAPSENSE_ISX_RX_PIN:
                    *convertedPinState = CY_CAPSENSE_PIN_STATE_IDX_ISX_RX;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;

            case CY_CAPSENSE_ISX_LX_PIN:
                    *convertedPinState = CY_CAPSENSE_PIN_STATE_IDX_ISX_LX;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) */

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
            case CY_CAPSENSE_PIN_STATE_WBX_NODE_A:
                    *convertedPinState = CY_CAPSENSE_PIN_STATE_WBX_NODE_A;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;

            case CY_CAPSENSE_PIN_STATE_WBX_NODE_B:
                    *convertedPinState = CY_CAPSENSE_PIN_STATE_WBX_NODE_B;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN) */

            default:
                /* No action on other sensor states */
                break;
        }
    #else
        switch (pinState)
        {
            case CY_CAPSENSE_GROUND:
                    *convertedPinState = CY_CAPSENSE_CTRLMUX_PIN_STATE_GND;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;

            case CY_CAPSENSE_HIGHZ:
                    *convertedPinState = CY_CAPSENSE_CTRLMUX_PIN_STATE_HIGH_Z;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
            case CY_CAPSENSE_SENSOR:
                    *convertedPinState = CY_CAPSENSE_CTRLMUX_PIN_STATE_SNS;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
            case CY_CAPSENSE_SHIELD:
                    *convertedPinState = CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;
            #endif
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
            case CY_CAPSENSE_TX_PIN:
                    *convertedPinState = CY_CAPSENSE_CTRLMUX_PIN_STATE_TX;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;

            case CY_CAPSENSE_RX_PIN:
                    *convertedPinState = CY_CAPSENSE_CTRLMUX_PIN_STATE_RX;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;

            #if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_DISABLE)
            case CY_CAPSENSE_NEGATIVE_TX_PIN:
                    *convertedPinState = CY_CAPSENSE_CTRLMUX_PIN_STATE_TX_NEGATIVE;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;

            case CY_CAPSENSE_VDDA2:
                    *convertedPinState = CY_CAPSENSE_CTRLMUX_PIN_STATE_VDDA2;
                    result = (uint32_t)CY_CAPSENSE_SUCCESS_E;
                break;
            #endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_DISABLE) */
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

            default:
                /* No action on other sensor states */
                break;
        }
    #endif

    return result;
}
#endif

#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3) || defined(CY_IP_M0S8MSCV3LP)) */
/* [] END OF FILE */
